Question #1

In [23]:
a = 0
def b():
    global a
    a = c(a)
    
def c(a):
    return a + 2

In [24]:
b()

In [25]:
b()

In [26]:
b()

In [27]:
a

6

when global a equals 0, -> c(a) will return (a + 2) -> (0 + 2) = 2
for each iteration of b(), 2 will be added to the output
the final output of a will then be 6

Question #5

In [22]:
#collatz() using int x as input & prints sequence starting at x
def collatz(x):
    while x != 1: #stopping before 1 as x != 1
        print(x, end = ' ')
        if x & 1: 
            x = 3 * x + 1 #if x is odd
        else:
            x = x//2 #if x is even
            
    print(x) #print 1
        
collatz(1)
collatz(10)

1
10 5 16 8 4 2 1

Question #6

In [105]:
#creating a recurvise method to take a non-binary integer n and print the binary equivalent
def binary(n):
    return bin(n).replace("0b","")


if __name__ == '__main__':
    print(binary(0))
    print(binary(1))
    print(binary(3))
    print(binary(9))

0
1
11
1001

Question #9

In [30]:
#loading the sql extension
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [31]:
#command to connect to the sql database
%sql sqlite://

'Connected: @None'

In [32]:
#creating the table Indidata using SQlite
%%sql sqlite://
    CREATE TABLE IndiData (
    City varchar(255),
    Country varchar(255),
    Season varchar(255),
    Temperature float,
    Rainfall float
    );

Done.

[]

In [84]:
#importing values into the table rows
%%sql
INSERT INTO IndiData 
(City, Country, Season, Temperature, Rainfall) VALUES
('Mumbai','India','Winter','24.8','5.9'),
('Mumbai','India','Spring','28.4','16.2'),
('Mumbai','India','Summer','27.9','1549.4'),
('Mumbai','India','Fall','27.6','346.0'),
('London','United Kingdom','Winter','4.2','207.7'),
('London','United Kingdom','Spring','8.3','169.6'),
('London','United Kingdom','Summer','15.7','157.0'),
('London','United Kingdom','Fall','10.4','218.5'),
('Cario','Egypt','Winter','13.6','16.5'),
('Cario','Egypt','Spring','20.7','6.5'),
('Cario','Egypt','Summer','27.7','0.1'),
('Cario','Egypt','Fall','22.2','4.5');

 * sqlite://
12 rows affected.

[]

In [85]:
#to select all the Temperature data readings
%sql SELECT Temperature from IndiData;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,),
 (24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [87]:
#selecting all cities without repetition we use the DISTINCT command
%sql SELECT DISTINCT City from IndiData

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cario',)]

In [88]:
# to get all the records from india
%sql SELECT * from IndiData WHERE Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

In [36]:
#selecting all 'Fall' records from Season
%sql SELECT * from IndiData WHERE Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cario', 'Egypt', 'Fall', 22.2, 4.5)]

In [91]:
#city, country and season with rainfall between 200 & 400
%sql SELECT City, Country, Season from IndiData WHERE Rainfall BETWEEN 200 AND 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall'),
 ('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [92]:
#city and country where Fall temperature is above 20
%sql SELECT City, Country FROM IndiData WHERE Season = 'Fall' and Temperature>= 20 ORDER BY Temperature;

 * sqlite://
Done.

[('Cario', 'Egypt'),
 ('Cario', 'Egypt'),
 ('Mumbai', 'India'),
 ('Mumbai', 'India')]

In [101]:
#the total annual rainfall for cairo
%sql SELECT SUM(Rainfall), City from IndiData WHERE City="Cario";

 * sqlite://
Done.

[(55.2, 'Cario')]

In [103]:
#the total rainfall for each season
%sql SELECT SUM(Rainfall), Season from IndiData GROUP BY Season;

 * sqlite://
Done.

[(1138.0, 'Fall'),
 (384.59999999999997, 'Spring'),
 (3413.0, 'Summer'),
 (460.2, 'Winter')]

Question #10

In [45]:
word=['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']
Uppercase = []

for the in word:
    Uppercase.append(the.upper())
    
print(Uppercase)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [46]:
word=['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']
Lowercase = []

for the in word:
    Lowercase.append(the.lower())
    
print(Lowercase)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [47]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

Wlength = []

for the in word:
    Wlength.append(len(the))
    
print(Wlength)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [48]:
list(map(list, zip(Uppercase,Lowercase,Wlength)))

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

In [54]:
LenFour = []

for the in word:
    if len(the)>=4:
        LenFour.append(the)
          
print(LenFour)

['quick', 'brown', 'jumps', 'over', 'lazy']